In [1]:
import pandas as pd

In [3]:
df1 = pd.read_clipboard()
df1

   凭证号码  企业名称  企业类型
0   123  张三公司   NaN
1   456  李四公司   NaN
2   789  张三公司   NaN
3  1234  王五公司   NaN
4  4567  王五公司   NaN
5  7890  李四公司   NaN

In [5]:
df2 = pd.read_clipboard()
df2

   单位名称 企类型划分种类
0  张三公司      大型
1  李四公司      中型
2  王五公司      小型
3  赵六公司      微型

In [6]:
df2.set_index('单位名称').企类型划分种类

单位名称
张三公司    大型
李四公司    中型
王五公司    小型
赵六公司    微型
Name: 企类型划分种类, dtype: object

In [7]:
df1.assign(企业类型 = df1.企业名称.map(df2.set_index('单位名称').企类型划分种类))

   凭证号码  企业名称 企业类型
0   123  张三公司   大型
1   456  李四公司   中型
2   789  张三公司   大型
3  1234  王五公司   小型
4  4567  王五公司   小型
5  7890  李四公司   中型